import numpy as np

# 双目相机参数
class stereoCamera(object):
    def __init__(self):
        # 左相机内参
        self.cam_matrix_left = np.array([   [524.7554 ,    0.0519 ,  645.4873],
                                            [ 0,       525.5439 ,    369.2896],
                                            [ 0,                0,     1.0000]
                                        ])
        # 右相机内参
        self.cam_matrix_right = np.array([  [522.7673,    0.1781,   645.8975],
                                            [       0,  523.4836 ,  352.8808 ],
                                            [       0,        0,    1.0000]
                                        ])

        # 左右相机畸变系数:[k1, k2, p1, p2, k3]
        self.distortion_l = np.array([[-0.1122,  0.1456,  0.0007215, -0.0000329,  -0.0810]])
        self.distortion_r = np.array([[-0.1014,   0.1099,   0.0003939,  -0.0001482  ,-0.0523]])

        # 旋转矩阵
        self.R = np.array([ [1.0000,   0.0028,  -0.0053],
                            [-0.0028,  1.0000,   -0.0017],
                            [ 0.0053,    0.0017 ,   1.0000]
                            ])
        # 平移矩阵
        self.T = np.array([[-120.8869], [ -0.2829 ], [0.2560]])
        # 焦距
        self.focal_length = 525 # 默认值，一般取立体校正后的重投影矩阵Q中的 Q[2,3]
        # 基线距离
        self.baseline = 120.8869 # 单位：mm， 为平移向量的第一个参数（取绝对值）